NACA0012/NACA00122D_4deg_v150/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            empty;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

}

// ************************************************************************* //
